; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p14---int100n150-m25---int100c150---s399---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 level137 level138 level139 level140 level141 level142 level143 level144 level145 level146 level147 level148 level149 level150 level151 level152 level153 level154 level155 level156 level157 level158 level159 level160 level161 level162 level163 level164 level165 level166 level167 level168 level169 level170 level171 level172 level173 level174 level175 - fuellevel
)

(:init
(sum level0 level16 level16)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level1 level16 level17)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level2 level16 level18)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level3 level16 level19)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level4 level16 level20)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level5 level16 level21)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level6 level16 level22)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level7 level16 level23)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level8 level16 level24)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level9 level16 level25)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level10 level16 level26)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level11 level16 level27)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level12 level16 level28)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level13 level16 level29)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level14 level16 level30)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level15 level16 level31)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level16 level16 level32)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level17 level16 level33)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level18 level16 level34)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level19 level16 level35)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level20 level16 level36)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level21 level16 level37)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level22 level16 level38)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level23 level16 level39)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level24 level16 level40)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level25 level16 level41)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level26 level16 level42)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level27 level16 level43)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level28 level16 level44)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level29 level16 level45)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level30 level16 level46)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level31 level16 level47)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level32 level16 level48)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level33 level16 level49)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level34 level16 level50)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level35 level16 level51)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level36 level16 level52)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level37 level16 level53)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level37 level24 level61)
(sum level38 level16 level54)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level38 level24 level62)
(sum level39 level16 level55)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level39 level24 level63)
(sum level40 level16 level56)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level40 level24 level64)
(sum level41 level16 level57)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level41 level24 level65)
(sum level42 level16 level58)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level42 level24 level66)
(sum level43 level16 level59)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level43 level24 level67)
(sum level44 level16 level60)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level44 level24 level68)
(sum level45 level16 level61)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level45 level24 level69)
(sum level46 level16 level62)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level46 level24 level70)
(sum level47 level16 level63)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level47 level24 level71)
(sum level48 level16 level64)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level48 level24 level72)
(sum level49 level16 level65)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level49 level22 level71)
(sum level49 level24 level73)
(sum level50 level16 level66)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level50 level22 level72)
(sum level50 level24 level74)
(sum level51 level16 level67)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level51 level22 level73)
(sum level51 level24 level75)
(sum level52 level16 level68)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level52 level22 level74)
(sum level52 level24 level76)
(sum level53 level16 level69)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level53 level22 level75)
(sum level53 level24 level77)
(sum level54 level16 level70)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level54 level22 level76)
(sum level54 level24 level78)
(sum level55 level16 level71)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level55 level22 level77)
(sum level55 level24 level79)
(sum level56 level16 level72)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level56 level22 level78)
(sum level56 level24 level80)
(sum level57 level16 level73)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level57 level22 level79)
(sum level57 level24 level81)
(sum level58 level16 level74)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level58 level22 level80)
(sum level58 level24 level82)
(sum level59 level16 level75)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level59 level22 level81)
(sum level59 level24 level83)
(sum level60 level16 level76)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level60 level22 level82)
(sum level60 level24 level84)
(sum level61 level16 level77)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level61 level22 level83)
(sum level61 level24 level85)
(sum level62 level16 level78)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level62 level22 level84)
(sum level62 level24 level86)
(sum level63 level16 level79)
(sum level63 level19 level82)
(sum level63 level20 level83)
(sum level63 level22 level85)
(sum level63 level24 level87)
(sum level64 level16 level80)
(sum level64 level19 level83)
(sum level64 level20 level84)
(sum level64 level22 level86)
(sum level64 level24 level88)
(sum level65 level16 level81)
(sum level65 level19 level84)
(sum level65 level20 level85)
(sum level65 level22 level87)
(sum level65 level24 level89)
(sum level66 level16 level82)
(sum level66 level19 level85)
(sum level66 level20 level86)
(sum level66 level22 level88)
(sum level66 level24 level90)
(sum level67 level16 level83)
(sum level67 level19 level86)
(sum level67 level20 level87)
(sum level67 level22 level89)
(sum level67 level24 level91)
(sum level68 level16 level84)
(sum level68 level19 level87)
(sum level68 level20 level88)
(sum level68 level22 level90)
(sum level68 level24 level92)
(sum level69 level16 level85)
(sum level69 level19 level88)
(sum level69 level20 level89)
(sum level69 level22 level91)
(sum level69 level24 level93)
(sum level70 level16 level86)
(sum level70 level19 level89)
(sum level70 level20 level90)
(sum level70 level22 level92)
(sum level70 level24 level94)
(sum level71 level16 level87)
(sum level71 level19 level90)
(sum level71 level20 level91)
(sum level71 level22 level93)
(sum level71 level24 level95)
(sum level72 level16 level88)
(sum level72 level19 level91)
(sum level72 level20 level92)
(sum level72 level22 level94)
(sum level72 level24 level96)
(sum level73 level16 level89)
(sum level73 level19 level92)
(sum level73 level20 level93)
(sum level73 level22 level95)
(sum level73 level24 level97)
(sum level74 level16 level90)
(sum level74 level19 level93)
(sum level74 level20 level94)
(sum level74 level22 level96)
(sum level74 level24 level98)
(sum level75 level16 level91)
(sum level75 level19 level94)
(sum level75 level20 level95)
(sum level75 level22 level97)
(sum level75 level24 level99)
(sum level76 level16 level92)
(sum level76 level19 level95)
(sum level76 level20 level96)
(sum level76 level22 level98)
(sum level76 level24 level100)
(sum level77 level16 level93)
(sum level77 level19 level96)
(sum level77 level20 level97)
(sum level77 level22 level99)
(sum level77 level24 level101)
(sum level78 level16 level94)
(sum level78 level19 level97)
(sum level78 level20 level98)
(sum level78 level22 level100)
(sum level78 level24 level102)
(sum level79 level16 level95)
(sum level79 level19 level98)
(sum level79 level20 level99)
(sum level79 level22 level101)
(sum level79 level24 level103)
(sum level80 level16 level96)
(sum level80 level19 level99)
(sum level80 level20 level100)
(sum level80 level22 level102)
(sum level80 level24 level104)
(sum level81 level16 level97)
(sum level81 level19 level100)
(sum level81 level20 level101)
(sum level81 level22 level103)
(sum level81 level24 level105)
(sum level82 level16 level98)
(sum level82 level19 level101)
(sum level82 level20 level102)
(sum level82 level22 level104)
(sum level82 level24 level106)
(sum level83 level16 level99)
(sum level83 level19 level102)
(sum level83 level20 level103)
(sum level83 level22 level105)
(sum level83 level24 level107)
(sum level84 level16 level100)
(sum level84 level19 level103)
(sum level84 level20 level104)
(sum level84 level22 level106)
(sum level84 level24 level108)
(sum level85 level16 level101)
(sum level85 level19 level104)
(sum level85 level20 level105)
(sum level85 level22 level107)
(sum level85 level24 level109)
(sum level86 level16 level102)
(sum level86 level19 level105)
(sum level86 level20 level106)
(sum level86 level22 level108)
(sum level86 level24 level110)
(sum level87 level16 level103)
(sum level87 level19 level106)
(sum level87 level20 level107)
(sum level87 level22 level109)
(sum level87 level24 level111)
(sum level88 level16 level104)
(sum level88 level19 level107)
(sum level88 level20 level108)
(sum level88 level22 level110)
(sum level88 level24 level112)
(sum level89 level16 level105)
(sum level89 level19 level108)
(sum level89 level20 level109)
(sum level89 level22 level111)
(sum level89 level24 level113)
(sum level90 level16 level106)
(sum level90 level19 level109)
(sum level90 level20 level110)
(sum level90 level22 level112)
(sum level90 level24 level114)
(sum level91 level16 level107)
(sum level91 level19 level110)
(sum level91 level20 level111)
(sum level91 level22 level113)
(sum level91 level24 level115)
(sum level92 level16 level108)
(sum level92 level19 level111)
(sum level92 level20 level112)
(sum level92 level22 level114)
(sum level92 level24 level116)
(sum level93 level16 level109)
(sum level93 level19 level112)
(sum level93 level20 level113)
(sum level93 level22 level115)
(sum level93 level24 level117)
(sum level94 level16 level110)
(sum level94 level19 level113)
(sum level94 level20 level114)
(sum level94 level22 level116)
(sum level94 level24 level118)
(sum level95 level16 level111)
(sum level95 level19 level114)
(sum level95 level20 level115)
(sum level95 level22 level117)
(sum level95 level24 level119)
(sum level96 level16 level112)
(sum level96 level19 level115)
(sum level96 level20 level116)
(sum level96 level22 level118)
(sum level96 level24 level120)
(sum level97 level16 level113)
(sum level97 level19 level116)
(sum level97 level20 level117)
(sum level97 level22 level119)
(sum level97 level24 level121)
(sum level98 level16 level114)
(sum level98 level19 level117)
(sum level98 level20 level118)
(sum level98 level22 level120)
(sum level98 level24 level122)
(sum level99 level16 level115)
(sum level99 level19 level118)
(sum level99 level20 level119)
(sum level99 level22 level121)
(sum level99 level24 level123)
(sum level100 level16 level116)
(sum level100 level19 level119)
(sum level100 level20 level120)
(sum level100 level22 level122)
(sum level100 level24 level124)
(sum level101 level16 level117)
(sum level101 level19 level120)
(sum level101 level20 level121)
(sum level101 level22 level123)
(sum level101 level24 level125)
(sum level102 level16 level118)
(sum level102 level19 level121)
(sum level102 level20 level122)
(sum level102 level22 level124)
(sum level102 level24 level126)
(sum level103 level16 level119)
(sum level103 level19 level122)
(sum level103 level20 level123)
(sum level103 level22 level125)
(sum level103 level24 level127)
(sum level104 level16 level120)
(sum level104 level19 level123)
(sum level104 level20 level124)
(sum level104 level22 level126)
(sum level104 level24 level128)
(sum level105 level16 level121)
(sum level105 level19 level124)
(sum level105 level20 level125)
(sum level105 level22 level127)
(sum level105 level24 level129)
(sum level106 level16 level122)
(sum level106 level19 level125)
(sum level106 level20 level126)
(sum level106 level22 level128)
(sum level106 level24 level130)
(sum level107 level16 level123)
(sum level107 level19 level126)
(sum level107 level20 level127)
(sum level107 level22 level129)
(sum level107 level24 level131)
(sum level108 level16 level124)
(sum level108 level19 level127)
(sum level108 level20 level128)
(sum level108 level22 level130)
(sum level108 level24 level132)
(sum level109 level16 level125)
(sum level109 level19 level128)
(sum level109 level20 level129)
(sum level109 level22 level131)
(sum level109 level24 level133)
(sum level110 level16 level126)
(sum level110 level19 level129)
(sum level110 level20 level130)
(sum level110 level22 level132)
(sum level110 level24 level134)
(sum level111 level16 level127)
(sum level111 level19 level130)
(sum level111 level20 level131)
(sum level111 level22 level133)
(sum level111 level24 level135)
(sum level112 level16 level128)
(sum level112 level19 level131)
(sum level112 level20 level132)
(sum level112 level22 level134)
(sum level112 level24 level136)
(sum level113 level16 level129)
(sum level113 level19 level132)
(sum level113 level20 level133)
(sum level113 level22 level135)
(sum level113 level24 level137)
(sum level114 level16 level130)
(sum level114 level19 level133)
(sum level114 level20 level134)
(sum level114 level22 level136)
(sum level114 level24 level138)
(sum level115 level16 level131)
(sum level115 level19 level134)
(sum level115 level20 level135)
(sum level115 level22 level137)
(sum level115 level24 level139)
(sum level116 level16 level132)
(sum level116 level19 level135)
(sum level116 level20 level136)
(sum level116 level22 level138)
(sum level116 level24 level140)
(sum level117 level16 level133)
(sum level117 level19 level136)
(sum level117 level20 level137)
(sum level117 level22 level139)
(sum level117 level24 level141)
(sum level118 level16 level134)
(sum level118 level19 level137)
(sum level118 level20 level138)
(sum level118 level22 level140)
(sum level118 level24 level142)
(sum level119 level16 level135)
(sum level119 level19 level138)
(sum level119 level20 level139)
(sum level119 level22 level141)
(sum level119 level24 level143)
(sum level120 level16 level136)
(sum level120 level19 level139)
(sum level120 level20 level140)
(sum level120 level22 level142)
(sum level120 level24 level144)
(sum level121 level16 level137)
(sum level121 level19 level140)
(sum level121 level20 level141)
(sum level121 level22 level143)
(sum level121 level24 level145)
(sum level122 level16 level138)
(sum level122 level19 level141)
(sum level122 level20 level142)
(sum level122 level22 level144)
(sum level122 level24 level146)
(sum level123 level16 level139)
(sum level123 level19 level142)
(sum level123 level20 level143)
(sum level123 level22 level145)
(sum level123 level24 level147)
(sum level124 level16 level140)
(sum level124 level19 level143)
(sum level124 level20 level144)
(sum level124 level22 level146)
(sum level124 level24 level148)
(sum level125 level16 level141)
(sum level125 level19 level144)
(sum level125 level20 level145)
(sum level125 level22 level147)
(sum level125 level24 level149)
(sum level126 level16 level142)
(sum level126 level19 level145)
(sum level126 level20 level146)
(sum level126 level22 level148)
(sum level126 level24 level150)
(sum level127 level16 level143)
(sum level127 level19 level146)
(sum level127 level20 level147)
(sum level127 level22 level149)
(sum level127 level24 level151)
(sum level128 level16 level144)
(sum level128 level19 level147)
(sum level128 level20 level148)
(sum level128 level22 level150)
(sum level128 level24 level152)
(sum level129 level16 level145)
(sum level129 level19 level148)
(sum level129 level20 level149)
(sum level129 level22 level151)
(sum level129 level24 level153)
(sum level130 level16 level146)
(sum level130 level19 level149)
(sum level130 level20 level150)
(sum level130 level22 level152)
(sum level130 level24 level154)
(sum level131 level16 level147)
(sum level131 level19 level150)
(sum level131 level20 level151)
(sum level131 level22 level153)
(sum level131 level24 level155)
(sum level132 level16 level148)
(sum level132 level19 level151)
(sum level132 level20 level152)
(sum level132 level22 level154)
(sum level132 level24 level156)
(sum level133 level16 level149)
(sum level133 level19 level152)
(sum level133 level20 level153)
(sum level133 level22 level155)
(sum level133 level24 level157)
(sum level134 level16 level150)
(sum level134 level19 level153)
(sum level134 level20 level154)
(sum level134 level22 level156)
(sum level134 level24 level158)
(sum level135 level16 level151)
(sum level135 level19 level154)
(sum level135 level20 level155)
(sum level135 level22 level157)
(sum level135 level24 level159)
(sum level136 level16 level152)
(sum level136 level19 level155)
(sum level136 level20 level156)
(sum level136 level22 level158)
(sum level136 level24 level160)
(sum level137 level16 level153)
(sum level137 level19 level156)
(sum level137 level20 level157)
(sum level137 level22 level159)
(sum level137 level24 level161)
(sum level138 level16 level154)
(sum level138 level19 level157)
(sum level138 level20 level158)
(sum level138 level22 level160)
(sum level138 level24 level162)
(sum level139 level16 level155)
(sum level139 level19 level158)
(sum level139 level20 level159)
(sum level139 level22 level161)
(sum level139 level24 level163)
(sum level140 level16 level156)
(sum level140 level19 level159)
(sum level140 level20 level160)
(sum level140 level22 level162)
(sum level140 level24 level164)
(sum level141 level16 level157)
(sum level141 level19 level160)
(sum level141 level20 level161)
(sum level141 level22 level163)
(sum level141 level24 level165)
(sum level142 level16 level158)
(sum level142 level19 level161)
(sum level142 level20 level162)
(sum level142 level22 level164)
(sum level142 level24 level166)
(sum level143 level16 level159)
(sum level143 level19 level162)
(sum level143 level20 level163)
(sum level143 level22 level165)
(sum level143 level24 level167)
(sum level144 level16 level160)
(sum level144 level19 level163)
(sum level144 level20 level164)
(sum level144 level22 level166)
(sum level144 level24 level168)
(sum level145 level16 level161)
(sum level145 level19 level164)
(sum level145 level20 level165)
(sum level145 level22 level167)
(sum level145 level24 level169)
(sum level146 level16 level162)
(sum level146 level19 level165)
(sum level146 level20 level166)
(sum level146 level22 level168)
(sum level146 level24 level170)
(sum level147 level16 level163)
(sum level147 level19 level166)
(sum level147 level20 level167)
(sum level147 level22 level169)
(sum level147 level24 level171)
(sum level148 level16 level164)
(sum level148 level19 level167)
(sum level148 level20 level168)
(sum level148 level22 level170)
(sum level148 level24 level172)
(sum level149 level16 level165)
(sum level149 level19 level168)
(sum level149 level20 level169)
(sum level149 level22 level171)
(sum level149 level24 level173)
(sum level150 level16 level166)
(sum level150 level19 level169)
(sum level150 level20 level170)
(sum level150 level22 level172)
(sum level150 level24 level174)
(sum level151 level16 level167)
(sum level151 level19 level170)
(sum level151 level20 level171)
(sum level151 level22 level173)
(sum level151 level24 level175)
(sum level152 level16 level168)
(sum level152 level19 level171)
(sum level152 level20 level172)
(sum level152 level22 level174)
(sum level153 level16 level169)
(sum level153 level19 level172)
(sum level153 level20 level173)
(sum level153 level22 level175)
(sum level154 level16 level170)
(sum level154 level19 level173)
(sum level154 level20 level174)
(sum level155 level16 level171)
(sum level155 level19 level174)
(sum level155 level20 level175)
(sum level156 level16 level172)
(sum level156 level19 level175)
(sum level157 level16 level173)
(sum level158 level16 level174)
(sum level159 level16 level175)

(connected l0 l3)
(fuelcost level24 l0 l3)
(connected l0 l4)
(fuelcost level19 l0 l4)
(connected l1 l2)
(fuelcost level22 l1 l2)
(connected l1 l3)
(fuelcost level19 l1 l3)
(connected l2 l1)
(fuelcost level22 l2 l1)
(connected l2 l3)
(fuelcost level20 l2 l3)
(connected l2 l4)
(fuelcost level16 l2 l4)
(connected l3 l0)
(fuelcost level24 l3 l0)
(connected l3 l1)
(fuelcost level19 l3 l1)
(connected l3 l2)
(fuelcost level20 l3 l2)
(connected l3 l4)
(fuelcost level22 l3 l4)
(connected l4 l0)
(fuelcost level19 l4 l0)
(connected l4 l2)
(fuelcost level16 l4 l2)
(connected l4 l3)
(fuelcost level22 l4 l3)

(at t0 l1)
(fuel t0 level175)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l2)
(at p3 l3)
(at p4 l2)
(at p5 l0)
(at p6 l0)
(at p7 l3)
(at p8 l3)
(at p9 l1)
(at p10 l2)
(at p11 l1)
(at p12 l4)
(at p13 l4)
)

(:goal
(and
(at p0 l4)
(at p1 l1)
(at p2 l3)
(at p3 l0)
(at p4 l0)
(at p5 l1)
(at p6 l3)
(at p7 l4)
(at p8 l2)
(at p9 l0)
(at p10 l3)
(at p11 l0)
(at p12 l0)
(at p13 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 14
2. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 0 of 14
3. (drive t0 l1 l3 level156 level19 level175)
   deleted: (at t0 l1) (fuel t0 level175)
   added: (at t0 l3) (fuel t0 level156)
   goals met: 0 of 14
4. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 0 of 14
5. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 14
6. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 14
7. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 14
8. (drive t0 l3 l2 level136 level20 level156)
   deleted: (at t0 l3) (fuel t0 level156)
   added: (at t0 l2) (fuel t0 level136)
   goals met: 0 of 14
9. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 1 of 14
10. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 1 of 14
11. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 1 of 14
12. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 1 of 14
13. (drive t0 l2 l4 level120 level16 level136)
   deleted: (at t0 l2) (fuel t0 level136)
   added: (at t0 l4) (fuel t0 level120)
   goals met: 1 of 14
14. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 2 of 14
15. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 3 of 14
16. (load p13 t0 l4)
   deleted: (at p13 l4)
   added: (in p13 t0)
   goals met: 3 of 14
17. (load p12 t0 l4)
   deleted: (at p12 l4)
   added: (in p12 t0)
   goals met: 3 of 14
18. (drive t0 l4 l0 level101 level19 level120)
   deleted: (at t0 l4) (fuel t0 level120)
   added: (at t0 l0) (fuel t0 level101)
   goals met: 3 of 14
19. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 3 of 14
20. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 3 of 14
21. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 3 of 14
22. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 4 of 14
23. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 5 of 14
24. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 6 of 14
25. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 7 of 14
26. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 8 of 14
27. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 9 of 14
28. (drive t0 l0 l3 level77 level24 level101)
   deleted: (at t0 l0) (fuel t0 level101)
   added: (at t0 l3) (fuel t0 level77)
   goals met: 9 of 14
29. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 10 of 14
30. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 11 of 14
31. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 12 of 14
32. (drive t0 l3 l1 level58 level19 level77)
   deleted: (at t0 l3) (fuel t0 level77)
   added: (at t0 l1) (fuel t0 level58)
   goals met: 12 of 14
33. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 13 of 14
34. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 14 of 14
